import LeanProofs.Flux.Prelude
import LeanFixpoint
open Classical

namespace F



def LoopA := ∃ k0 : (a0 : Int) -> (a1 : Int) -> (a2 : Int) -> Prop, ∃ k1 : (a0 : Int) -> (a1 : Int) -> (a2 : Int) -> (a3 : Int) -> Prop, ∃ k2 : (a0 : Int) -> (a1 : Int) -> (a2 : Int) -> (a3 : Int) -> (a4 : Int) -> (a5 : Int) -> Prop, ∃ k3 : (a0 : Int) -> (a1 : Int) -> (a2 : Int) -> (a3 : Int) -> (a4 : Int) -> (a5 : Int) -> (a6 : Int) -> (a7 : Int) -> (a8 : Int) -> (a9 : Int) -> Prop, 
 ∀ (n₀ : Int),
  (n₀ > 0) ->
   (0 ≤ n₀) ->
    (n₀ ≥ 0) ->
     (((n₀ - 1) ≥ 0)) ∧
     ((((k0 ((n₀ - 1) / 4) (n₀ - 1) n₀))) ∧
     (∀ (n4₀ : Int),
      ∀ (n2₀ : Int),
       ((k0 n4₀ n2₀ n₀)) ->
        (2 < n2₀) ->
         (((k1 1 n₀ n4₀ n2₀))) ∧
         (∀ (j₀ : Int),
          ((k1 j₀ n₀ n4₀ n2₀)) ->
           ((¬(j₀ ≤ n4₀)) ->
            ((k0 (n4₀ / 2) (n2₀ / 2) n₀))) ∧
           ((j₀ ≤ n4₀) ->
            (((k2 (2 * n2₀) j₀ n₀ n4₀ n2₀ j₀))) ∧
            (∀ (id₀ : Int),
             ∀ (is₀ : Int),
              ((k2 id₀ is₀ n₀ n4₀ n2₀ j₀)) ->
               ((¬(is₀ < (n₀ - 1))) ->
                ((k1 (j₀ + 1) n₀ n4₀ n2₀))) ∧
               ((is₀ < (n₀ - 1)) ->
                (((k3 ((is₀ + n4₀) + n4₀) (is₀ + n4₀) is₀ (((is₀ + n4₀) + n4₀) + n4₀) n₀ n4₀ n2₀ j₀ id₀ is₀))) ∧
                (∀ (i2₀ : Int),
                 ∀ (i1₀ : Int),
                  ∀ (i0₀ : Int),
                   ∀ (i3₀ : Int),
                    ((k3 i2₀ i1₀ i0₀ i3₀ n₀ n4₀ n2₀ j₀ id₀ is₀)) ->
                     ((¬(i3₀ ≤ (n₀ - 1))) ->
                      ((((2 * id₀) - n2₀) ≥ 0)) ∧
                      (((k2 (4 * id₀) (((2 * id₀) - n2₀) + j₀) n₀ n4₀ n2₀ j₀)))
                      ) ∧
                     ((i3₀ ≤ (n₀ - 1)) ->
                      ((i0₀ < n₀)) ∧
                      ((i2₀ < n₀)) ∧
                      ((i0₀ < n₀)) ∧
                      ((i2₀ < n₀)) ∧
                      ((i0₀ < n₀)) ∧
                      ((i1₀ < n₀)) ∧
                      ((i3₀ < n₀)) ∧
                      ((i1₀ < n₀)) ∧
                      ((i3₀ < n₀)) ∧
                      ((i1₀ < n₀)) ∧
                      ((i0₀ < n₀)) ∧
                      ((i2₀ < n₀)) ∧
                      ((i0₀ < n₀)) ∧
                      ((i2₀ < n₀)) ∧
                      ((i0₀ < n₀)) ∧
                      ((i1₀ < n₀)) ∧
                      ((i3₀ < n₀)) ∧
                      ((i1₀ < n₀)) ∧
                      ((i3₀ < n₀)) ∧
                      ((i1₀ < n₀)) ∧
                      ((i2₀ < n₀)) ∧
                      ((i2₀ < n₀)) ∧
                      ((i3₀ < n₀)) ∧
                      ((i3₀ < n₀)) ∧
                      (((k3 (i2₀ + id₀) (i1₀ + id₀) (i0₀ + id₀) (i3₀ + id₀) n₀ n4₀ n2₀ j₀ id₀ is₀)))
                      )
                     )
                )
               )
            )
           )
         )
     )
     
end F
